function GetData() {
    return {
        "orgs": [
            {
                "name": "ГМУ Ушакова",
                "groups": [
                    "1 1",
                    "1 2",
                    "1 3"
                ]
            },
            {
                "name": "НКСЭ",
                "groups": [
                    "2 1",
                    "2 2",
                    "2 3"
                ]
            },
            {
                "name": "Что-то ещё",
                "groups": [
                    "3 1",
                    "3 2",
                    "3 3"
                ]
            }
        ],
        "tests": [
            {
                "name": "Зависимое поведение",
                "answerType": "simple",
                "questions": [
                    { "number": 1, "text": "Я постараюсь отнестись к исследованию ответственно и быть максимально искрен-ним (искренней)."},
                    { "number": 2, "text": "У меня очень сложный и трудный для окружающих характер."},
                    { "number": 3, "text": "Я лучше справляюсь с работой в тиши и одиночестве, чем в присутствии многих лю-дей или в шумном месте."},
                    { "number": 4, "text": "Решая серьезные проблемы, я, как правило, обхожусь без посторонней помощи."},
                    { "number": 5, "text": "Я очень редко заговариваю первым (первой) с незнакомыми людьми."},
                    { "number": 6, "text": "Для меня важно, что подумают другие о моих высказываниях и поступках."},
                    { "number": 7, "text": "Если будет нужно, я разрушу все преграды на пути к достижению цели."},
                    { "number": 8, "text": "Я часто тревожусь по пустякам."},
                    { "number": 9, "text": "В моих неудачах виноваты определенные люди."},
                    { "number": 10, "text": "Для меня важно иметь общее мнение с теми людьми, с которыми я обычно общаюсь."},
                    { "number": 11, "text": "Меня мало касается все, что случается с другими."},
                    { "number": 12, "text": "Мне интересны яркие, артистичные личности."},
                    { "number": 13, "text": "Мне нет дела до чужих страданий: хватает своих."},
                    { "number": 14, "text": "В шумной компании я чаще всего в роли только наблюдателя."},
                    { "number": 15, "text": "Для меня невыносимо наблюдать страдания других людей."},
                    { "number": 16, "text": "Я - человек абсолютно правдивый и искренний.а"},
                    { "number": 17, "text": "Все мои беды связаны с собственным неумением ладить с людьми."},
                    { "number": 18, "text": "Меня часто тянет к шумным компаниям."},
                    { "number": 19, "text": "Принимая важное решение, я всегда действую самостоятельно."},
                    { "number": 20, "text": "Мне всегда приятно заводить новых знакомых."},
                    { "number": 21, "text": "Берясь за какое-либо дело, я не стану долго раздумывать, прежде чем начать действо-вать."},
                    { "number": 22, "text": "Меня раздражают люди, пытающиеся изменить мое мнение, когда я уверен(а) в своей правоте."},
                    { "number": 23, "text": "Я часто волнуюсь за близких мне людей даже без серьезного повода."},
                    { "number": 24, "text": "Я не могу терпеть, когда кто-нибудь меняет заведенный мной порядок."},
                    { "number": 25, "text": "Я умею привлекать к себе внимание окружающих меня людей."},
                    { "number": 26, "text": "В жизни я твердо придерживаюсь определенных принципов."},
                    { "number": 27, "text": "Люблю посещать компании, где можно танцевать или петь."},
                    { "number": 28, "text": "Я чрезвычайно чувствителен (чувствительна) к изменениям в настроении окружаю-щих меня людей."},
                    { "number": 29, "text": "Я могу, не смущаясь, дурачиться в веселой компании."},
                    { "number": 30, "text": "Я могу, не смущаясь, дурачиться в веселой компании."},
                    { "number": 31, "text": "Я никогда не поступаю как эгоист (эгоистка)."},
                    { "number": 32, "text": "Часто бывает так, что из-за меня у окружающих портится настроение."},
                    { "number": 33, "text": "Интересные идеи приходят мне в голову чаще, когда я один (одна), не в присутствии многих людей."},
                    { "number": 34, "text": "Я могу взять на себя ответственность за целую группу людей для пользы дела."},
                    { "number": 35, "text": "Мне трудно преодолеть застенчивость, когда нужно говорить перед группой людей."},
                    { "number": 36, "text": "Мнение старших по возрасту или положению большого значения для меня не имеет."},
                    { "number": 37, "text": "Мне не трудно заставить других людей действовать так, как я считаю нужным."},
                    { "number": 38, "text": "Я так сильно переживаю неудачи, что у меня ухудшается самочувствие."},
                    { "number": 39, "text": "Я всегда бываю упрям(а) в тех случаях, когда уверен(а) в своей правоте."},
                    { "number": 40, "text": "Если в компании я не нахожусь в центре внимания, мне становится скучно и неинте-ресно."},
                    { "number": 41, "text": "Никто не может навязать мне свое мнение."},
                    { "number": 42, "text": "Мне нравится путешествовать с разными, каждый раз новыми попутчиками."},
                    { "number": 43, "text": "Я могу изменить свое мнение под давлением окружающих."},
                    { "number": 44, "text": "В поезде я с удовольствием провожу время в беседе с соседями по купе."},
                    { "number": 45, "text": "Я никогда не вру."},
                    { "number": 46, "text": "Я никогда не откладываю на завтра то, что следует сделать сегодня."},
                    { "number": 47, "text": "Я вечно ничем недоволен (недовольна)."},
                    { "number": 48, "text": "Я люблю одиночество, позволяющее мне сосредоточиться на своих мыслях."},
                    { "number": 49, "text": "Я умею заинтересовать людей и повести их за собой."},
                    { "number": 50, "text": "Мне нравится командовать другими."},
                    { "number": 51, "text": "Я умею дать отпор тем, кто вмешивается в мои дела."},
                    { "number": 52, "text": "Мне бывает неловко за высказывания и поступки моих близких"},
                    { "number": 53, "text": "Мне нередко приходилось в драке защищать свои права."},
                    { "number": 54, "text": "Я испытываю чувство вины (или даже стыда), если меня преследуют неудачи."},
                    { "number": 55, "text": "Мое настроение находится в сильной зависимости от настроя тех, кто меня окружает."},
                    { "number": 56, "text": "Я добиваюсь своего упорством и настойчивостью."},
                    { "number": 57, "text": "Мне часто бывает скучно, когда вокруг все веселятся."},
                    { "number": 58, "text": "Мое грустное настроение легко исправляется, если я смотрю в кино или по телевизо-ру комедийное представление."},
                    { "number": 59, "text": "Ради сохранения добрых отношений я могу отказаться от своих намерений."},
                    { "number": 60, "text": "Я всегда придерживаюсь общепринятых правил поведения."},
                    { "number": 61, "text": "Меня любят все мои друзья."},
                    { "number": 62, "text": "У меня трагичная судьба."},
                    { "number": 63, "text": "У меня много близких друзей."},
                    { "number": 64, "text": "Я-самый несчастный человек на свете."},
                    { "number": 65, "text": "Мне проще надеяться на других, чем брать на себя ответственность, даже если речь идет о моих проблемах."},
                    { "number": 66, "text": "Я стараюсь быть таким (такой) «как все», не выделяться среди других."},
                    { "number": 67, "text": "Я - человек спокойный, уравновешенный."},
                    { "number": 68, "text": "Я могу долго не реагировать на чьи-то шутки, но потом «взорваться» гневной реакци-ей."},
                    { "number": 69, "text": "Я очень чувствителен (чувствительна) к изменениям погоды."},
                    { "number": 70, "text": "Я не люблю присутствовать на шумных застольях."},
                    { "number": 71, "text": "Я могу проявить безалаберность в делах, а потом понемногу приводить их в порядок."},
                    { "number": 72, "text": "Я люблю ходить в гости."},
                    { "number": 73, "text": "Мне все равно, что обо мне думают окружающие."},
                    { "number": 74, "text": "Я волнуюсь только по поводу очень больших неприятностей."},
                    { "number": 75, "text": "Я никогда не испытываю желания выругаться."},
                    { "number": 76, "text": "Я никого никогда не обманывал(а)."},
                    { "number": 77, "text": "Мне никто не нужен, и я не нужен (не нужна) никому."},
                    { "number": 78, "text": "Я - человек застенчивый."},
                    { "number": 79, "text": "Мне ужасно не везет в жизни."},
                    { "number": 80, "text": "Я часто стараюсь следовать советам более авторитетной личности."},
                    { "number": 81, "text": "Я бы очень переживал(а), если бы кого-то задел(а) или обидел(а)."},
                    { "number": 82, "text": "Меня ничем не испугать."},
                    { "number": 83, "text": "Я часто пользуюсь чужими советами при решении своих проблем."},
                    { "number": 84, "text": "В своих неудачах я в первую очередь виню самого (саму) себя."},
                    { "number": 85, "text": "Я совершенно не обращаю внимания на свой стиль одежды."},
                    { "number": 86, "text": "Я не стараюсь планировать свое ближайшее будущее и работу."},
                    { "number": 87, "text": "Когда меня зовут в гости, я чаще всего думаю: «Лучше бы мне остаться дома»."},
                    { "number": 88, "text": "Я ничего не знаю о личных проблемах окружающих меня людей."},
                    { "number": 89, "text": "Малейшая неудача резко снижает мое настроение."},
                    { "number": 90, "text": "Я никогда не сержусь."},
                    { "number": 91, "text": "Я отвечал(а) на все вопросы очень правдиво."},

                ]
            },
            {
                "name": "Употребление наркотиков",
                "answerType": "simple",
                "questions": [
                    { "number": 1, "Я склонен разочаровываться в людях"},
                    { "number": 2, "Верить в приметы глупо"},
                    { "number": 3, "Часто бывает, что я обижаюсь на родителей и друзей"},
                    { "number": 4, "Нередко я опаздываю на учебу или на встречу из-за непредвиденных случайностей в пути."},
                    { "number": 5, "Окружающие часто удивляют меня своим поведением"},
                    { "number": 6, "Мои родители часто пытаются обращаться со мной как с маленьким ребенком"},
                    { "number": 7, "Я люблю планировать свое время до мелочей и с точностью до минут"},
                    { "number": 8, "Мне кажется, что я чувствую происходящее вокруг более остро, чем другие"},
                    { "number": 9, "Родители сами виноваты, что их дети начинают принимать наркотики"},
                    { "number": 10, "Для меня не существует абсолютных авторитетов"},
                    { "number": 11, "В детстве был период, когда я страстно любил что-либо подсчитывать (количество окон, ступеней...)"},
                    { "number": 12, "Если бы родители и другие взрослые больше бы говорили с детьми о вреде наркотиков, то мало кто становился бы наркоманом"},
                    { "number": 13, "Мне легче перенести скандал, чем однообразную размеренную жизнь"},
                    { "number": 14, "Я верю в порчу и сглаз"},
                    { "number": 15, "Прежде, чем что-либо предпринять, я стараюсь предусмотреть все опасности, которые могут подстерегать меня"},
                    { "number": 16, "Если я чем-то увлеченно занят(-а), то часто даже не замечаю, что происходит вокруг"},
                    { "number": 17, "Я живу и поступаю в соответствие с поговоркой: \"Надейся на лучшее, но готовься на худшее\"."},
                    { "number": 18, "Меня нелегко убедить в чем бы то ни было"},
                    { "number": 19, "Меня нередко обманывали (обманывают)"},
                    { "number": 20, "Неизвестность для меня очень мучительна и тягостна"},
                    { "number": 21, "Меня раздражает, когда на улице, в магазине или в транспорте на меня пристально смот-рят"},
                    { "number": 22, "Жизнь малоинтересна, когда в ней нет опасностей"},
                    { "number": 23, "Я не уважаю тех, кто отрывается от коллектива"},
                    { "number": 24, "Некоторые люди одним прикосновением могут исцелить больного человека"},
                    { "number": 25, "Жизнь должна быть радостной, иначе незачем жить"},
                    { "number": 26, "Я хорошо ориентируюсь во времени и, не глядя на часы, могу точно сказать, который сейчас час"},
                    { "number": 27, "Если я хочу что-нибудь сделать, но окружающие считают, что этого делать не стоит, я готов отказаться от своих намерений"},
                    { "number": 28, "В детстве я часто отказывался оставаться один"},
                    { "number": 29, "Мне нередко бывает скучно, когда себя нечем занять"},
                    { "number": 30, "В жизни надо попробовать все"},
                    { "number": 31, "Я легко могу заснуть в любое удобное время (и ночью и днем)"},
                    { "number": 32, "После того, как я схожу в лес за грибами, у меня долго перед глазами могут сохраняться воспоминания о грибах"},
                    { "number": 33, "Я люблю помечтать о том, на что я потрачу возможный будущий выигрыш в лотерее, как поступлю с обещанным подарком"},
                    { "number": 34, "Часто думаю: \"Хорошо бы стать ребенком\""},
                    { "number": 35, "Мне часто трудно находить правильные слова для моих чувств"},
                    { "number": 36, "Для меня несложно дать знакомому денег взаймы на покупку спиртного"},
                    { "number": 37, "Я склонен жить, стараясь не отягощать себя раздумьями о том, что может произойти со мной в будущем"},
                    { "number": 38, "Я люблю, когда гадают на картах или по руке"},
                    { "number": 39, "Мне хорошо удается копировать мимику и жесты других людей"},
                    { "number": 40, "Когда меня будят ночью или рано утром, то я долго не могу понять, что происходит во-круг"},
                    { "number": 41, "Музыку я люблю громкую, а не тихую"},
                    { "number": 42, "У меня бывают чувства, которым я не могу дать вполне точное определение"},
                    { "number": 43, "Человек должен стараться понимать свои сны, руководствоваться ими в жизни и извле-кать из них предостережения"},
                    { "number": 44, "Меня трудно застать врасплох"},
                    { "number": 45, "Все известные мне \"чудеса\" объясняются очень просто: обман и фокусы"},
                    { "number": 46, "Меня считают наивным человеком, поскольку мне часто случается попадать впросак"},
                    { "number": 47, "Наркотики бывают ''легкими'', и они не вызывают наркомании"},
                    { "number": 48, "Я иногда чувствовал, что кто-то посредством гипноза заставлял меня совершать какие-либо поступки"},
                    { "number": 49, "Мои знакомые считают меня романтиком"},
                    { "number": 50, "Я верю в чудеса"},
                    { "number": 51, "Даже психически здоровый человек иногда не может отвечать за свои поступки"},
                    { "number": 52, "Меня часто озадачивает поведение и поступки людей, которых я давно знаю"},
                    { "number": 53, "Никому нельзя доверять - это правильная позиция"},
                    { "number": 54, "Самое счастливое время - это молодость"},
                    { "number": 55, "В детстве я боялся, что мама может бросить меня, уйти из дома и не вернуться"},
                    { "number": 56, "Я склонен лучше помнить неприятные события, происшедшие со мной в действительно-сти, чем собственные прогнозы по поводу возможности таких событий"},
                    { "number": 57, "Я люблю советоваться с друзьями (или взрослыми), как поступить в сложной ситуации"},
                    { "number": 58, "Я бы согласился пожить пусть мало, но бурно"},
                    { "number": 59, "Я бы мог на спор ввести себе в вену наркотик (героин)"},
                    { "number": 60, "Часто меня не оценивали по заслугам"},
                    { "number": 61, "Я всегда точно могу сказать, сколько денег я потратил и сколько у меня осталось"},
                    { "number": 62, "В детстве я долго не мог привыкнуть к детскому саду (яслям) и не хотел туда из-за этого ходить"},
                    { "number": 63, "Своим друзьям или подругам я доверяю полностью и убежден, что они меня никогда не обманут и не предадут"},
                    { "number": 64, "Опасность употребления наркотиков явно преувеличена"},
                    { "number": 65, "О жизни все-таки мало ярких событий"},
                    { "number": 66, "Я не люблю длительные поездки в поезде или на автобусе"},
                    { "number": 67, "Меня раздражает грязное стекло, потому что весь мир тогда кажется грязным"},
                    { "number": 68, "Когда мне скучно я обычно ложусь спать"},
                    { "number": 69, "Часто родители упрекают меня в том, что я слушаю излишне громкую музыку"},
                    { "number": 70, "Очень мучительно чего-либо ждать"},
                    { "number": 71, "Я мог бы после некоторых предварительных объяснений управлять маленьким самолетом"},
                    { "number": 72, "Я нередко просыпаюсь утром за несколько секунд или минут до звонка будильника"},
                    { "number": 73, "Если бы случился пожар и мне надо было бы из окна пятого этажа прыгнуть на развернутый пожарниками тент, я бы сделал это не задумываясь"},
                    { "number": 74, "Мне жалко наивных людей"},
                    { "number": 75, "Меня смущает, когда люди долго и пристально смотрят мне в глаза"},
                    { "number": 76, "Рисковать всем, например, в казино, могут только сильные люди"},
                    { "number": 77, "В том, что подросток становится наркоманом, виноваты те, кто продает наркотики"},
                    { "number": 78, "Я люблю очень быструю, а не медленную езду"},
                    { "number": 79, "Я доверяю предсказаниям гороскопов и следую содержащимся в них рекомендациям"},
                    { "number": 80, "Меня очень интересуют лотереи"},
                    { "number": 81, "Прогнозировать будущее - бесполезное дело, т.к. многое от тебя не зависит"},
                    { "number": 82, "Я способен с легкостью описывать свои чувства"},
                    { "number": 83, "У меня в жизни бывали случаи, когда я что-то делал, а потом не помнил, что именно"},
                    { "number": 84, "Считаю, что любопытство не порок"},
                    { "number": 85, "Бывают, что меня пугают люди с громким голосом"},
                    { "number": 86, "У меня было (есть) много увлечений (интересов, хобби)"},
                    { "number": 87, "Когда я остаюсь дома, то мне часто бывает не по себе от одиночества"},
                    { "number": 88, "Я не суеверен"},
                    { "number": 89, "Мне говорили, что у меня неплохие способности имитировать голоса или повадки людей"},
                    { "number": 90, "Есть люди, которым я верю безоговорочно"},
                    { "number": 91, "Случается, что во время разговора с заикающимся я сам начинаю говорить сбивчиво и с запинками"},
                    { "number": 92, "Самое тягостное в жизни - это одиночество"},
                    { "number": 93, "Если я начинаю играть в какую-нибудь игру, то меня нередко нелегко оторвать от нее"},
                    { "number": 94, "Бывает, что я могу сделать назло то, что мне самому окажется невыгодным"},
                    { "number": 95, "Меня всегда притягивала и притягивает таинственность, загадочность, мистика"},
                    { "number": 96, "Бывало, что я на улице соглашался на игру с\"наперсточниками\""},
                    { "number": 97, "Я знаю многих ребят, кто употребляет или употреблял наркотики"},
                    { "number": 98, "Я, как правило, ставлю будильник так, чтобы не только все успеть сделать до ухода из дома, но и иметь несколько минут в запасе"},
                    { "number": 99, "В своей жизни я часто сталкиваюсь(лся-лась) с невообразимым стечением неблагоприят-ных обстоятельств"},
                    { "number": 100, "Я готов полностью подчиниться и даже доверить свою судьбу, но только тому, кого действительно уважаю"},
                    { "number": 101, "Я люблю рисковать"},
                    { "number": 102, "Среди моих знакомых есть люди, которые обладают даром убеждать"},
                    { "number": 103, "Меня часто невозможно оторвать от интересного дела, игры, занятия"},
                    { "number": 104, "Я мог бы прыгнуть с парашютом"},
                    { "number": 105, "Мне все-равно, что обо мне думают окружающие"},
                    { "number": 106, "Меня многое в жизни удивляет"},
                    { "number": 107, "Я могу переспорить кого угодно"},
                    { "number": 108, "Я вошел бы вместе с укротителем в клетку со львами, если бы он мне сказал, что это безопасно"},
                    { "number": 109, "Если меня о чем-то просят, мне трудно отказать"},
                    { "number": 110, "Мне легче придумать свои собственные примеры, чем выучить наизусть примеры из учебника"},
                    { "number": 111, "Мне никогда не бывает скучно"},
                    { "number": 112, "Часто я сам от себя не ожидаю какого-либо поступка"},
                    { "number": 113, "В детстве у меня какое-то время были тики или разнообразные повторяющиеся движе-ния"},
                    { "number": 114, "Я люблю помечтать о том, на что я потрачу возможный будущий выигрыш в лотерее, как поступлю с обещанным подарком"},
                    { "number": 115, "Меня влечет все новое и необычное"},
                    { "number": 116, "Со мной нередко бывают \"несчастные случаи\" и всяческие происшествия"},
                ]
            },
            {
                "name": "Девиантное поведение (МУЖ)",
                "answerType": "extended",
                "questions": [
                    { "number": 1, "Я предпочитаю одежду неярких, приглушенных тонов."}
                    { "number": 2, "Бывает, что я откладываю на завтра то, что должен сделать сегодня."}
                    { "number": 3, "Я охотно записался бы добровольцем для участия в каких-либо боевых действиях."}
                    { "number": 4, "Бывает, что иногда я ссорюсь с родителями."}
                    { "number": 5, "Тот, кто в детстве не дрался, вырастает «маменькиным сынком» и ничего не может до-биться в жизни."}
                    { "number": 6, "Я бы взялся за опасную для жизни работу, если бы за нее хорошо платили."}
                    { "number": 7, "Иногда я ощущаю такое сильное беспокойство, что просто не могу усидеть на месте."}
                    { "number": 8, "Иногда бывает, что я немного хвастаюсь."}
                    { "number": 9, "Если бы мне пришлось стать военным, тоя хотел бы быть летчиком-истребителем."}
                    { "number": 10, "Я ценю в людях осторожность и осмотрительность."}
                    { "number": 11, "Только слабые и трусливые люди выполняют все правила и законы."}
                    { "number": 12, "Я предпочел бы работу, связанную с переменами и путешествиями."}
                    { "number": 13, "Я всегда говорю только правду."}
                    { "number": 14, "Если человек в меру и без вредных последствий употребляет возбуждающие и влияю-щие на психику вещества – это вполне нормально."}
                    { "number": 15, "Даже если я злюсь, то стараюсь не прибегать к ругательствам."}
                    { "number": 16, "Я думаю, что мне бы понравилось охотиться на львов."}
                    { "number": 17, "Если меня обидели, то я обязательно должен отмстить."}
                    { "number": 18, "Человек должен иметь право выпивать столько, сколько он хочет."}
                    { "number": 19, "Если мой приятель опаздывает к назначенному времени, то я обычно сохраняю спо-койствие."}
                    { "number": 20, "Мне обычно затрудняет работу требование сделать ее к определенному сроку."}
                    { "number": 21, "Иногда я перехожу улицу татам, где мне удобно, а не там, где положено."}
                    { "number": 22, "Некоторые правила и запреты можно отбросить, если испытываешь сильное сексуаль-ное (половое) влечение."}
                    { "number": 23, "Я иногда не слушаюсь родителей."}
                    { "number": 24, "Если при покупке автомобиля мне придется выбирать между скоростью и безопасно-стью, то я выберу безопасность."}
                    { "number": 25, "Я думаю, что мне понравилось бы заниматься боксом."}
                    { "number": 26, "Если бы я мог свободно выбирать профессию, то стал бы дегустатором вин."}
                    { "number": 27, "Я часто испытываю потребность в острых ощущениях."}
                    { "number": 28, "Иногда мне так и хочется сделать себе больно."}
                    { "number": 29, "Мое отношение к жизни хорошо описывает пословица: «Семь раз отмерь, один раз от-режь»."}
                    { "number": 30, "Я всегда покупаю билеты в общественном транспорте."}
                    { "number": 31, "Среди моих знакомых есть люди, которые пробовали одурманивающие токсические вещества."}
                    { "number": 32, "Я всегда выполняю обещания, даже если мне это невыгодно."}
                    { "number": 33, "Бывает, что мне так и хочется выругаться."}
                    { "number": 34, "Правы люди, которые в жизни следуют пословиц: «Если нельзя, но очень хочется, то можно»."}
                    { "number": 35, "Бывало, что я случайно попадал в драку после употребления спиртных напитков."}
                    { "number": 36, "Мне редко удается заставить себя продолжать работу после ряда обидных неудач."}
                    { "number": 37, "Если бы в наше время проводились бы бои гладиаторов, то бы обязательно в них по-участвовал."}
                    { "number": 38, "Бывает, что иногда я говорю неправду"}
                    { "number": 39, "Терпеть боль назло всем бывает даже приятно."}
                    { "number": 40, "Я лучше соглашусь с человеком, чем стану спорить."}
                    { "number": 41, "Если бы я родился в давние времена, то стал бы благородным разбойником."}
                    { "number": 42, "Если нет другого выхода, то спор можно разрешить и дракой."}
                    { "number": 43, "Бывали случаи, когда мои родители, другие взрослые высказывали беспокойство по поводу того, что я немного выпил."}
                    { "number": 44, "Одежда должна с первого взгляда выделять человека среди других в толпе."}
                    { "number": 45, "Если в кинофильме нет ни одной приличной драки – это плохое кино."}
                    { "number": 46, "Когда люди стремятся к новым необычным ощущениям и переживаниям – это нор-мально."}
                    { "number": 47, "Иногда я скучаю на уроках"}
                    { "number": 48, "Если меня кто-то случайно задел в толпе, то я обязательно потребую от него извине-ний."}
                    { "number": 49, "Если человек раздражает меня, то готов высказать ему все, что я о нем думаю."}
                    { "number": 50, "Во время путешествий и поездок я люблю отклоняться от обычных маршрутов."}
                    { "number": 51, "Мне бы понравилась профессия дрессировщика хищных зверей."}
                    { "number": 52, "Если уж ты сел за руль мотоцикла, то стоит ехать только очень быстро."}
                    { "number": 53, "Когда я читаю детектив, то мне часто хочется, чтобы преступник ушел от преследова-ния."}
                    { "number": 54, "Иногда я просто не могу удержаться от смеха, когда слышу неприличную шутку."}
                    { "number": 55, "Я стараюсь избегать в разговоре выражений, которые могут смутить окружающих."}
                    { "number": 56, "Я часто огорчаюсь из-за мелочей."}
                    { "number": 57, "Когда мне возражают, я часто взрываюсь и отвечаю резко."}
                    { "number": 58, "Мне больше нравится читать о приключениях, чем о любовных историях."}
                    { "number": 59, "Чтобы получить удовольствие, стоит нарушить некоторые правила и запреты."}
                    { "number": 60, "Мне нравится бывать в компаниях, где в меру выпивают и веселятся."}
                    { "number": 61, "Меня раздражает, когда девушки курят."}
                    { "number": 62, "Мне нравится состояние, которое наступает, когда в меру и в хорошей компании выпь-ешь."}
                    { "number": 63, "Бывало, что у меня возникало желание выпить, хотя я понимал, что сейчас не время и не место."}
                    { "number": 64, "Сигарета в трудную минуту меня успокаивает."}
                    { "number": 65, "Мне легко заставить других людей бояться меня, и иногда ради забавы я это делаю."}
                    { "number": 66, "Я смог бы своей рукой казнить преступника, справедливо приговоренного к высшей мере наказания."}
                    { "number": 67, "Удовольствие – это главное, к чему стоит стремиться в жизни."}
                    { "number": 68, "Я хотел бы поучаствовать в автомобильных гонках."}
                    { "number": 69, "Когда у меня плохое настроение, ко мне лучше не подходить."}
                    { "number": 70, "Иногда у меня бывает такое настроение, что я готов первым начать драку."}
                    { "number": 71, "Я могу вспомнить случаи, кода я был таким злым, что хватал первую попавшуюся под руку вещь и ломал ее."}
                    { "number": 72, "Я всегда требую, чтобы окружающие уважали мои права."}
                    { "number": 73, "Мне понравилось бы прыгать с парашютом."}
                    { "number": 74, "Вредное воздействие на человека алкоголя и табака сильно преувеличивают."}
                    { "number": 75, "Я редко даю сдачи, даже если кто-то ударит меня."}
                    { "number": 76, "Я не получаю удовольствия от ощущения риска."}
                    { "number": 77, "Когда человек в пылу спора прибегает к «сильным» выражениям – это нормально."}
                    { "number": 78, "Я часто не могу сдержать свои чувства."}
                    { "number": 79, "Бывало, что я опаздывал на уроки."}
                    { "number": 80, "Мне нравятся компании, где все подшучивают друг над другом."}
                    { "number": 81, "Секс должен занимать в жизни молодежи одно из главных мест."}
                    { "number": 82, "Часто я не могу удержаться от спора, если кто-то не согласен со мной."}
                    { "number": 83, "Иногда случалось, что я не выполнял домашнее задание."}
                    { "number": 84, "Я часто совершаю поступки под влиянием минутного настроения."}
                    { "number": 85, "Мне кажется, что я не способен ударить человека."}
                    { "number": 86, "Люди справедливо возмущаются, когда узнают, что преступник остался безнаказан-ным."}
                    { "number": 87, "Бывает, что мне приходится скрывать от взрослых некоторые свои поступки."}
                    { "number": 88, "Наивные простаки сами заслуживают того, чтобы их обманывали."}
                    { "number": 89, "Иногда я бываю так раздражен, что стучу по столу кулаком."}

                ]
            },
            {
                "name": "Девиантное поведение (ЖЕН)",
                "answerType": "extended",
                "questions": [
                    { "number": 1, "text": "Я стремлюсь в одежде следовать самой современной моде или даже опережать ее."},
                    { "number": 2, "text": "Бывает, что я откладываю на завтра то, что должна сделать сегодня."},
                    { "number": 3, "text": "Если бы была такая возможность, то я бы с удовольствием пошла служить в армию."},
                    { "number": 4, "text": "Бывает, что иногда я ссорюсь с родителями."},
                    { "number": 5, "text": "Чтобы добиться своего, девушка иногда может и подраться."},
                    { "number": 6, "text": "Я бы взялась за опасную для здоровья работу, если бы за нее хорошо платили."},
                    { "number": 7, "text": "Иногда я ощущаю такое сильное беспокойство, что просто не могу усидеть на месте."},
                    { "number": 8, "text": "Я иногда люблю посплетничать."},
                    { "number": 9, "text": "Мне нравятся профессии, связанные с риском для жизни."},
                    { "number": 10, "text": "Мне нравится, когда моя одежда и внешний вид раздражают людей старшего поколе-ния."},
                    { "number": 11, "text": "Только глупые и трусливые люди выполняют все правила и законы."},
                    { "number": 12, "text": "Я предпочла бы работу, связанную с переменами и путешествиями, даже если она опасна для жизни."},
                    { "number": 13, "text": "Я всегда говорю только правду."},
                    { "number": 14, "text": "Если человек в меру и без вредных последствий употребляет возбуждающие и влияю-щие на психику вещества – это нормально."},
                    { "number": 15, "text": "Даже если я злюсь, то стараюсь никого не ругать."},
                    { "number": 16, "text": "Я с удовольствием смотрю боевики."},
                    { "number": 17, "text": "Если меня обидели, то я обязательно должна отомстить."},
                    { "number": 18, "text": "Человек должен иметь право выпивать, сколько он хочет и где он хочет."},
                    { "number": 19, "text": "Если моя подруга опаздывает к назначенному времени, то я обычно сохраняю спокой-ствие."},
                    { "number": 20, "text": "Мне часто бывает трудно сделать роботу к точно определенному сроку."},
                    { "number": 21, "text": "Иногда я перехожу улицу там, где мне удобно, а не там, где положено."},
                    { "number": 22, "text": "Некоторые правила и запреты можно отбросить, если чего-нибудь сильно хочешь."},
                    { "number": 23, "text": "Бывало, что я не слушалась родителей."},
                    { "number": 24, "text": "В автомобиле я больше ценю безопасность, чем скорость."},
                    { "number": 25, "text": "Я думаю, что мне понравилось бы заниматься каратэ или похожим видом спорта."},
                    { "number": 26, "text": "Мне бы понравилась работа официантки в ресторане."},
                    { "number": 27, "text": "Я часто испытываю потребность в острых ощущениях."},
                    { "number": 28, "text": "Иногда мне так и хочется сделать себе больно."},
                    { "number": 29, "text": "Мое отношении к жизни хорошо описывает пословица: «Семь раз отмерь, один раз от-режь»."},
                    { "number": 30, "text": "Я всегда плачу за проезд в общественном транспорте."},
                    { "number": 31, "text": "Среди моих знакомых есть люди, которые пробовали одурманивающие токсические вещества."},
                    { "number": 32, "text": "Я всегда выполняю обещания, даже если мне это не выгодно."},
                    { "number": 33, "text": "Бывает, что мне так и хочется выругаться."},
                    { "number": 34, "text": "Правы люди, которые в жизни следуют пословице: «Если нельзя, но очень хочется, то можно»."},
                    { "number": 35, "text": "Бывало, что я случайно попадала в неприятную историю после употребления спиртных напитков."},
                    { "number": 36, "text": "Я часто не могу заставить себя продолжать какое-либо занятие после обидной неудачи."},
                    { "number": 37, "text": "Многие запреты в области секса старомодны и их можно отбросить."},
                    { "number": 38, "text": "Бывает, что иногда я говорю неправду."},
                    { "number": 39, "text": "Терпеть боль назло всем бывает даже приятно."},
                    { "number": 40, "text": "Я лучше соглашусь с человеком, чем стану спорить."},
                    { "number": 41, "text": "Если бы я родилась в древние времена, то стала бы благородной разбойницей."},
                    { "number": 42, "text": "Добиваться победы в споре нужно любой ценой."},
                    { "number": 43, "text": "Бывали случаи, когда мои родители, другие взрослые высказывали беспокойство по поводу того, что я немного выпила."},
                    { "number": 44, "text": "Одежда должна с первого взгляда выделять человека среди других в толпе."},
                    { "number": 45, "text": "Если в фильме нет ни одной приличной драки – это плохое кино."},
                    { "number": 46, "text": "Бывает я скучаю на уроках."},
                    { "number": 47, "text": "Если меня кто-то случайно задел в толпе, то я обязательно потребую от него извине-ний."},
                    { "number": 48, "text": "Если человек раздражает меня, то я готова высказать ему все, что о нем думаю."},
                    { "number": 49, "text": "Во время путешествий и поездок я люблю отклонятся от обычных маршрутов."},
                    { "number": 50, "text": "Мне бы понравилась профессия дрессировщицы хищных зверей."},
                    { "number": 51, "Мне нравится ощущать скорость при быстрой езде на автомобиле и мотоцикле."},
                    { "number": 52, "Когда я читаю детектив, то мне часто хочется, чтобы преступник ушел от преследова-ния."},
                    { "number": 53, "Бывает, что я с интересом слушаю неприличный, но смешной анекдот."},
                    { "number": 54, "Мне нравится иногда смущать и ставить в неловкое положение окружающих."},
                    { "number": 55, "Я часто огорчаюсь из-за мелочей."},
                    { "number": 56, "Когда мне возражают, я часто взрываюсь и отвечаю резко."},
                    { "number": 57, "Мне больше нравится читать о кровавых преступлениях или о катастрофах."},
                    { "number": 58, "Чтобы получить удовольствие, стоит нарушить некоторые правила и запреты."},
                    { "number": 59, "Мне нравится бывать в компаниях, где в меру выпивают и веселятся."},
                    { "number": 60, "Я считаю вполне нормальным, если девушка курит."},
                    { "number": 61, "Мне нравится состояние, которые наступает, когда выпьешь в меру и в хорошей компании."},
                    { "number": 62, "Бывало, что у меня возникало желание выпить, хотя я понимала, что сейчас не время и не место."},
                    { "number": 63, "Сигарета в трудную минуту меня успокаивает."},
                    { "number": 64, "Некоторые люди побаиваются меня."},
                    { "number": 65, "Я бы хотела присутствовать при казни преступника, справедливо приговоренного к высшей мере наказания."},
                    { "number": 66, "Удовольствие – это главное, к чему стоит стремиться в жизни."},
                    { "number": 67, "Если бы могла, то с удовольствием поучаствовала бы в автомобильных гонках."},
                    { "number": 68, "Когда у меня плохое настроение, ко мне лучше не подходить."},
                    { "number": 69, "Иногда у меня бывает такое настроение, что я готова первым начать драку."},
                    { "number": 70, "Я могу вспомнить случаи, когда я настолько разозлилась, что хватала первую попав-шуюся под руку вещь и ломала ее."},
                    { "number": 71, "Я всегда требую, чтобы окружающие уважали мои права."},
                    { "number": 72, "Мне бы хотелось из любопытства прыгнуть с парашютом."},
                    { "number": 73, "Вредное воздействие алкоголя и табака на человека сильно преувеличивают."},
                    { "number": 74, "Счастливы те, кто умирают молодыми."},
                    { "number": 75, "Я получаю удовольствие, когда немного рискую."},
                    { "number": 76, "Когда человек в пылу спора прибегает к ругательствам – это допустимо."},
                    { "number": 77, "Я часто не могу сдержать свои чувства."},
                    { "number": 78, "Бывало, что я опаздывала на уроки."},
                    { "number": 79, "Мне нравятся компании, где все подшучивают друг над другом"},
                    { "number": 80, "Секс должен занимать в жизни молодежи одно из главных мест."},
                    { "number": 81, "Часто я не могу удержаться от спора, если кто-то не согласен со мной."},
                    { "number": 82, "Иногда случалось, что я не выполняла школьное домашнее задание."},
                    { "number": 83, "Я часто совершаю поступки под влиянием минутного настроения."},
                    { "number": 84, "Бывают случаи, когда я могу ударить человека."},
                    { "number": 85, "Люди справедливо возмущаются, когда узнают, что преступник остался безнаказан-ным."},
                    { "number": 86, "Бывает, что мне приходится скрывать от взрослых некоторые свои поступки."},
                    { "number": 87, "Наивные простаки сами заслуживаю того, чтобы их обманывали."},
                    { "number": 88, "Иногда я бываю так раздражена, что громко кричу."},
                    { "number": 89, "Только неожиданные обстоятельства и чувство опасности позволяют мне по-настоящему проявить себя."},
                    { "number": 90, "Я бы попробовала какое-нибудь одурманивающее вещество, если бы твердо знала, что это не повредит моему здоровью и не повлечет наказания."},
                    { "number": 91, "Когда я стою на мосту, то меня иногда так и тянет прыгнуть вниз."},
                    { "number": 92, "Всякая грязь меня пугает или вызывает сильное отвращение."},
                    { "number": 93, "Когда я злюсь, то мне хочется громко обругать виновника моих неприятностей."},
                    { "number": 94, "Я думаю, что люди должны отказаться от всякого употребления спиртных напитков."},
                    { "number": 95, "Я бы с удовольствием покатилась бы на горных лыжах с крутого склона.."},
                    { "number": 96, "Иногда, если кто-то причиняет мне боль, то это бывает даже приятно."},
                    { "number": 97, "Я бы с удовольствием занималась в бассейне прыжками с вышки."},
                    { "number": 98, "Мне иногда не хочется жить."},

                ]
            }
        ]
    };
}

let TestData;

let global_wrapper;
let start_screen;

let org_select;
let grp_select;

let test_choose_screen;

let test_buttons;

let test_start_screen;
let current_test_title;

let test_question_screen;

let current_test;
let current_question = 1;

let percents;
let time;
let current_question_text;

let previous_question_button;
let next_question_button;

let finish_test_button;

let test_finish_screen;
let return_to_start_screen_button;

let yes_button;
let no_button;

$(document).ready(function() {
    TestData = GetData();
    //current_test = TestData.tests[0]; //FIXME убрать после теста

    global_wrapper = $("#global-wrapper");

    start_screen = $("#start-screen");
    test_choose_screen = $("#test-choose-screen");
    test_start_screen = $("#test-start-screen");
    current_test_title = $("#current-test-title");

    test_question_screen = $("#test-question-screen");

    percents = $("#percents");
    time = $("#time");
    current_question_text = $("#current-question");

    previous_question_button = $("#previous-question-button");
    next_question_button = $("#next-question-button");
    previous_question_button.click(() => previous_question());
    next_question_button.click(() => next_question());

    finish_test_button = $("#finish-test-button");
    finish_test_button.click(() => finish_test());

    test_finish_screen = $("#test-finish-screen");

    return_to_start_screen_button = $("#return-to-start-screen-button");
    return_to_start_screen_button.click(() => return_to_main_screen());

    org_select = $("#organization-select");
    grp_select = $("#group-select");
    test_buttons = $("#test-buttons");

    yes_button = $("#yes-button");
    no_button = $("#no-button");
    yes_button.click(() => click_answer("yes"));
    no_button.click(() => click_answer("no"));

    org_select.html(create_org_list(TestData.orgs));
    grp_select.html(create_grp_list(TestData.orgs[org_select.val()]));

    org_select.on("change", function() {
        grp_select.html(create_grp_list(TestData.orgs[org_select.val()]));

        org_select.css("background-color", "white");
        org_select.hover((e) => {
            $(this).css("background-color", e.type === "mouseenter" ? "#e7e7e7" : "white");
        })
    });

    grp_select.on("change", function() {
        grp_select.css("background-color", "white");
        grp_select.hover((e) => {
            $(this).css("background-color", e.type === "mouseenter" ? "#e7e7e7" : "white");
        });
    });

    $("#start-testing-button").click(function() {
        hasError = false;

        if (org_select.val() < 0) {
            org_select.css("background", "red");
            hasError = true;
        }

        if (grp_select.val() < 0) {
            grp_select.css("background", "red");
            hasError = true;
        }

        if (!hasError) {
            start_screen.addClass("hidden");
            test_choose_screen.removeClass("hidden");
            global_wrapper.removeClass("bg1");
            global_wrapper.addClass("bg2");

            test_buttons.html(generate_tests_buttons(TestData.tests));
            generate_test_buttons_events(TestData.tests);
        }
    });

    $("#back-to-start-screen-button").click(function() {
        test_choose_screen.addClass("hidden");
        start_screen.removeClass("hidden");
        global_wrapper.removeClass("bg2");
        global_wrapper.addClass("bg1");
    });

    $("#back-to-test-choose-screen-button").click(function() {
        test_start_screen.addClass("hidden");
        test_choose_screen.removeClass("hidden");
    });

    $("#begin-selected-test-button").click(function() {
        let isConfirm = confirm("Приступить к выполнению теста?");
        if (isConfirm) {
            test_start_screen.addClass("hidden");
            test_question_screen.removeClass("hidden");
            begin_test();
        }
    });

    //begin_test(); //FIXME убрать после теста
});

function create_org_list(orgs) {
    if (orgs == null || orgs.length < 1) {
        return create_list_item(-10, "[СПИСОК ПУСТ]");
    }

    let html = create_list_item(-1, "Выберите из списка...");

    for (let i = 0; i < orgs.length; i++) {
        html += create_list_item(i, orgs[i].name);
    }

    return html;
}

function create_grp_list(org) {
    if (org == null || org.groups.length < 1) {
        return create_list_item(-10, "");
    }
    else {
        let html = create_list_item(-1, "Выберите из списка...");

        for (let i = 0; i < org.groups.length; i++) {
            html += create_list_item(i , org.groups[i]);
        }

        return html;
    }
}

function create_list_item(value, text, extTags = "") {
    return `<option value="${value}" ${extTags}>${text}</option>\n`;
}

function generate_tests_buttons(tests) {
    if (tests == null) {
        return "";
    }

    let html = "";
    for (let i = 0; i < tests.length; i++) {
        html += create_test_button(i, tests[i].name);

        $(`#test-${i}-button`).click(function() {
            current_test = TestData.tests[i];
            current_test_title.html(current_test.name);
            test_choose_screen.addClass("hidden");
            test_start_screen.removeClass("hidden");
        });
    }

    return html;
}

function create_test_button(index, name) {
    return `<input type="button" id="test-${index}-button" value="${name}" class="button test-button">\n`;
}

function generate_test_buttons_events(tests) {
    if (tests == null) {
        return;
    }

    for (let i = 0; i < tests.length; i++) {
        $(`#test-${i}-button`).click(function() {
            current_test = TestData.tests[i];
            current_test_title.html(current_test.name);
            test_choose_screen.addClass("hidden");
            test_start_screen.removeClass("hidden");
        });
    }
}

let questions_passed = 1;

let answers = {};

function begin_test() {

    update_current_test_screen();
}

function click_answer(val) {
    answers[current_question] = val;

    if (current_question < current_test.questions.length) {
        current_question++;
    }

    if (questions_passed < current_question) {
        questions_passed = current_question;
    }

    update_current_test_screen();
}

function previous_question() {
    if (current_question > 1) {
        current_question--;
    }

    update_current_test_screen();
}

function next_question() {
    if (current_question < questions_passed) {
        current_question++;
    }

    update_current_test_screen();
}

function update_current_test_screen() {
    current_question_text.html(current_test.questions[current_question - 1].text);

    percents.html(`${questions_passed / current_test.questions.length * 100}%`);

    update_selected_answer(answers[current_question]);

    if (current_question <= 1) {
        previous_question_button.css("display", "none");
    } else {
        previous_question_button.css("display", "block");
    }

    if (current_question >= questions_passed) {
        next_question_button.css("display", "none");
    } else {
        next_question_button.css("display", "block");
    }

    if (Object.keys(answers).length == current_test.questions.length) {
        finish_test_button.css("display", "block");
    } else {
        finish_test_button.css("display", "none");
    }
}

function update_selected_answer(answer) {
    yes_button.removeClass("answered");
    no_button.removeClass("answered");

    if (answer == null) return;

    if (answer == "yes") {
        yes_button.addClass("answered");
    } else if (answer == "no") {
        no_button.addClass("answered");
    }
}

function finish_test() {
    let isFinished = confirm("Завершить прохождение теста?");

    if (!isFinished) return;

    let str = "";
    for (key in answers) {
        str += `${key}: ${answers[key]}\n`;
    }
    alert(str);

    test_question_screen.addClass("hidden");
    test_finish_screen.removeClass("hidden");
}

function return_to_main_screen() {
    location.reload();
}
